---
kind: property
id: P:Autodesk.Revit.DB.Plumbing.FluidTemperature.Temperature
source: html/6de062d0-e370-b202-7d23-b7ba7ce5a59d.htm
---
# Autodesk.Revit.DB.Plumbing.FluidTemperature.Temperature Property

The temperature value

## Syntax (C#)
```csharp
public double Temperature { get; set; }
```